# Encapsulation
Q : Modifier ใดที่สามารถเรียกใช้ได้แค่ภายในคลาสตัวเองเท่านั้น
* private ✔️
* protected ❌
# Inheritance
Q : ถ้าหากมีการสืบทอดมากกว่าหนึ่งคลาส และคลาสทั้งสองมีการสืบทอดมาจากคลาสเดียวกันและเกิดการ Overridden จะทำให้เกิดปัญหาใด
* Diamond Problem ✔️
* Shugo Chara ❌
# Relationship
Q : ถ้าไม่ได้สืบทอดจากคลาสใดเลยจะถือว่าสืบทอดจากคลาสใด
* คลาส Object ✔️
* คลาส Defualy Package ❌
# Polymorphism
Q : การทำให้เมธอดที่มีชื่อเหมือนกัน ภายในคลาสเดียวกันมีการทำงาน อินพุท หรือ มีผลลัพธ์ที่แตกต่างกัน เรียกว่า
* Overridden ❌
* Overloaded ✔️
# Constructor
Q : คอนสตัคเตอร์จะถูกเรียกใช้งานเมื่อเราสร้างวัตถุด้วยคำสั่งใด
* new ✔️
* create ❌
# this super
Q : ทุกๆ คอนสตรัคเตอร์จะมี ___ อยู่ภายในตัวมันเอง และถ้าหากเขียน ____ ต้องเขียนเป็นคำสั่งแรกเท่านั้น
* super() ✔️
* this() ❌

# special(1)
Q : เมธอด equals() จะทำการ return ชนิดตัวแปรใดออกมา
* String ❌
* boolean ✔️
